Revit.Elements.PlanView
Base class for Revit Plan views

Revit.Elements.PlanView.InternalSetPlanView(Autodesk.Revit.DB.ViewPlan)
Set the InternalViewPlan property and the associated element id and unique id
plan:

Revit.Elements.PlanView.InternalViewPlan
An internal handle on the Revit element

Revit.Elements.PlanView.InternalElement
Reference to the Element